app/Controllers/Home.php

SELECT *
FROM `products`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function products()
    {
        $productModel = new ProductModel();

        $data['products'] = $productModel->paginate(10);

SELECT *
FROM `products`
WHERE `id` IN ('2')
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `id` IN ('2')
---
    public function carts()
    {
        $session = \Config\Services::session();

        $carts = $session->get('carts');
        if ($carts) {
            $productModel = new ProductModel();
            $data['products'] = $productModel->whereIn('id', $carts)->paginate(10);

SELECT *
FROM `products`
WHERE `id` IN ('2')
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `id` IN ('2')
---
    public function checkout_view()
    {
        $session = \Config\Services::session();

        $carts = $session->get('carts');

        if ($carts) {

            $productModel = new ProductModel();
            $data['products'] = $productModel->whereIn('id', $carts)->paginate(10);

INSERT INTO `users` (`name`, `email`) VALUES ('Sandeep Patel', 'sandeep.patel@satyakabir.com')
INSERT INTO `orders` (`order_code`, `user_id`, `cart_total`, `product_ids`) VALUES ('202406239733', 33, 200, '[\"2\"]')
---
    public function checkout()
    {
        helper(['form', 'url']);

        $error = $this->validate([
            'name'    =>    'required|min_length[3]',
            'email'    =>    'required|valid_email',
        ]);

        if (!$error) {
            echo view('add_data', [
                'error'     => $this->validator
            ]);
        } else {

            $session = \Config\Services::session();

            $carts = $session->get('carts');
            $userModel = new UserModel();

            $userModel->save([
                'name'    =>    $this->request->getVar('name'),
                'email'    =>    $this->request->getVar('email'),
            ]);

            $orderModel = new OrderModel();
            $today = date("Ymd");
            $rand = sprintf("%04d", rand(0, 9999));
            $unique = $today . $rand;
            $orderModel->save([
                'order_code'    =>    $unique,
                'user_id'    =>    $userModel->getInsertID(),
                'cart_total' => $session->get('cart_total'),
                'product_ids' => json_encode($carts),
            ]);

SELECT *
FROM `products`
WHERE `id` IN ('2')
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `id` IN ('2')
---
            if ($carts) {

                $productModel = new ProductModel();
                $data['products'] = $productModel->whereIn('id', $carts)->paginate(10);